# GetElementIdForExternalDefinition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeParameters..::..GetElementIdForExternalDefinition Method
RebarShapeParameters Class See Also
---
Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, return InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ElementId GetElementIdForExternalDefinition(
	Document doc,
	ExternalDefinition externalDefinition
)
```

Visual Basic
---
```text
Public Shared Function GetElementIdForExternalDefinition ( _
	doc As Document, _
	externalDefinition As ExternalDefinition _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetElementIdForExternalDefinition(
	Document^ doc,
	ExternalDefinition^ externalDefinition
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..DocumentA document.
externalDefinition
    Type: Autodesk.Revit.DB..::..ExternalDefinitionA shared parameter.
# ### Return Value
An ElementId representing the shared parameter stored in the document, or InvalidElementId if the parameter is not stored in the document.
# Remarks
Before a parameter can be used in a RebarShapeDefinition, it must exist in the definition's document. There are two ways to achieve this. It can be bound to one or more categories in the document using the Document.ParameterBindings property, or it can be created by calling RebarShapeParameters.GetOrCreateElementIdForExternalDefinition().
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace